# 파일 입출력

In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv('ex1.csv')

In [4]:
df  # csv의 첫번째 행을 column index로 사용

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
df2 = pd.read_table('ex1.csv')

In [6]:
df2

  a,b,c,d,message
0   1,2,3,4,hello
1   5,6,7,8,world
2  9,10,11,12,foo

In [7]:
df3 = pd.read_table('ex1.csv', sep=',')

In [8]:
df3

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
df = pd.read_csv('ex2.csv')     # ec2.csv는 column 인덱스가 파일에 포함되어 있지 않음.

In [10]:
df      # column 인덱스가 없어서 첫번째 데이터가 column index로 됨. --> 의도와는 다르게 됨.

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [11]:
df2 = pd.read_csv('ex2.csv', header = None) # column 헤더가 없음

In [12]:
df2     # column header가 없어서 정수 값이 채워짐

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [13]:
df3 = pd.read_csv('ex2.csv', names = ['a', 'b', 'c', 'd', 'message'])   # names = [ ] 로 column index 설정.

In [14]:
df3

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [15]:
df4 = pd.read_csv('ex2.csv', names = ['a', 'b', 'c', 'd', 'message'], index_col = 'message')    # index_col = ' ' 를 통해 row index 설정. index_col 에서 index는 row index를 의미.

In [16]:
df4

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

## index_col을 이용해서 Hierarchical Index를 만들어 보자

In [18]:
df5 = pd.read_csv('csv_mindex.csv')

In [19]:
df5

  key1  key2   value1   value2
0  one     a        1        2
1  one     b        3        4
2  one     c        5        6
3  one     d        7        8
4  two     a        9       10
5  two     b       11       12
6  two     c       13       14
7  two     d       15       16

In [21]:
df5 = pd.read_csv('csv_mindex.csv', index_col = ['key1', 'key2'] )

In [22]:
df5

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [34]:
df6 = pd.read_csv('ex4.csv', skiprows=[0,2,3])

In [35]:
df6

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [27]:
df6 = pd.read_csv('ex4.csv', encoding='ms949')

In [28]:
df6

                            #설명하는 글들...
a               b   c   d       message
#데이터와 관계 없는 텍스트 NaN NaN NaN         NaN
fsfsdfsdfawd    NaN NaN NaN         NaN
1               2   3   4         hello
5               6   7   8         world
9               10  11  12          foo

# 파일로 저장하기

In [36]:
df6.to_csv('df6_out.csv')

In [37]:
df6.to_csv('df6_out_without_index.csv', index=False)

In [38]:
df6.to_csv('df6_out_without_index_header.csv', index=False, header=False)

In [39]:
df6.to_csv('df6_out2.csv', sep='\t')

# Merge

In [40]:
df1 = pd.DataFrame({'key':['b','b','a','c','a','a','b'],
                    'data1':range(7)
})

In [41]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [42]:
df2 = pd.DataFrame({'key':['a','b','d','b'],
                    'data2':range(4)
    })

In [43]:
df2

  key  data2
0   a      0
1   b      1
2   d      2
3   b      3

In [45]:
pd.merge(df1, df2)  # 'b'만 봤을 때, df1에서는 3줄, df2에서는 2줄 --> 3* 2 : 6줄. 'c'와 'd'는 공통된 key 값을 갖고 있는게 없기 때문에 병합이 되지 않음.

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      6      1
5   b      6      3
6   a      2      0
7   a      4      0
8   a      5      0

In [46]:
df1 = pd.DataFrame({'key1':['b','b','a','c','a','a','b'],
                    'data1':range(7)
})

In [47]:
df2 = pd.DataFrame({'key2':['a','b','d','b'],
                    'data2':range(4)
    })

In [48]:
pd.merge(df1, df2)      # --> df1과 df2에 공통된 column이 없기 때문에 MergeError 발생

MergeError: No common columns to perform merge on. Merge options: left_on=None, right_on=None, left_index=False, right_index=False

In [49]:
pd.merge(df1, df2, left_on='key1', right_on='key2')

  key1  data1 key2  data2
0    b      0    b      1
1    b      0    b      3
2    b      1    b      1
3    b      1    b      3
4    b      6    b      1
5    b      6    b      3
6    a      2    a      0
7    a      4    a      0
8    a      5    a      0

## inner join : 공통된 key 값들만 합쳐줌. (default)

In [50]:
pd.merge(df1, df2, left_on='key1', right_on='key2', how='left') # how='left' 를 넣어주면 왼쪽 값(key1)을 기준으로 합치기때문에 c가 하나 더 생겨서 총 10개의 data가 나옴

  key1  data1 key2  data2
0    b      0    b    1.0
1    b      0    b    3.0
2    b      1    b    1.0
3    b      1    b    3.0
4    a      2    a    0.0
5    c      3  NaN    NaN
6    a      4    a    0.0
7    a      5    a    0.0
8    b      6    b    1.0
9    b      6    b    3.0

In [51]:
pd.merge(df1, df2, left_on='key1', right_on='key2', how='right')

  key1  data1 key2  data2
0    b    0.0    b      1
1    b    1.0    b      1
2    b    6.0    b      1
3    b    0.0    b      3
4    b    1.0    b      3
5    b    6.0    b      3
6    a    2.0    a      0
7    a    4.0    a      0
8    a    5.0    a      0
9  NaN    NaN    d      2

In [52]:
pd.merge(df1, df2, left_on='key1', right_on='key2', how='outer')    # how='outer' : 양쪽 data의 모든 값을 merge

   key1  data1 key2  data2
0     b    0.0    b    1.0
1     b    0.0    b    3.0
2     b    1.0    b    1.0
3     b    1.0    b    3.0
4     b    6.0    b    1.0
5     b    6.0    b    3.0
6     a    2.0    a    0.0
7     a    4.0    a    0.0
8     a    5.0    a    0.0
9     c    3.0  NaN    NaN
10  NaN    NaN    d    2.0

## Concatenating the data

In [53]:
s1 = pd.Series([0, 1], index=['a', 'b'])
s2 = pd.Series([2,1,3], index=['c', 'd', 'e'])
s3 = pd.Series([4,7], index=['a','e'])

In [54]:
s1

a    0
b    1
dtype: int64

In [55]:
s2

c    2
d    1
e    3
dtype: int64

In [56]:
s3

a    4
e    7
dtype: int64

In [57]:
pd.concat([s1, s2]) # 기본적으로 outer join

a    0
b    1
c    2
d    1
e    3
dtype: int64

In [58]:
pd.concat([s1, s2], axis=1)

     0    1
a  0.0  NaN
b  1.0  NaN
c  NaN  2.0
d  NaN  1.0
e  NaN  3.0

In [59]:
pd.concat([s1, s3])

a    0
b    1
a    4
e    7
dtype: int64

In [60]:
s1s3 = pd.concat([s1, s3])

In [61]:
s1s3

a    0
b    1
a    4
e    7
dtype: int64

In [62]:
s1s3['a']

a    0
a    4
dtype: int64

In [63]:
s1s3['b']

1

In [64]:
pd.concat([s1, s2, s3])

a    0
b    1
c    2
d    1
e    3
a    4
e    7
dtype: int64

In [65]:
pd.concat([s1, s2, s2], keys=['one', 'two', 'three'])

one    a    0
       b    1
two    c    2
       d    1
       e    3
three  c    2
       d    1
       e    3
dtype: int64

## 데이터 변형

In [67]:
# 중복된 값을 제거
df = pd.DataFrame({'k1':['one']*3 + ['two']*4,
                   'k2':[1,1,2,3,3,4,4]
})

In [68]:
['one']*3 + ['two']*4

['one', 'one', 'one', 'two', 'two', 'two', 'two']

In [72]:
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [71]:
# 중복값을 확인하는 메소드
# duplicated() : 전체 행에 대해서 중복이 되는지 안되는지 출력

df.duplicated()

0    False
1     True
2    False
3    False
4     True
5    False
6     True
dtype: bool

In [74]:
# duplicated() 해서 True가 나오는 행을 다 지움
# keep='first' default 값

df.drop_duplicates()

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

In [75]:
df.drop_duplicates(keep='last')

    k1  k2
1  one   1
2  one   2
4  two   3
6  two   4

In [77]:
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [76]:
#특정 열의 중복 값을 삭제하고 싶을때
# k1 열 중에서 중복된 값들 다 제외
# df.drop_duplicates(['k1'], keep='last') : 중복되는 것들 중 마지막 것을 남기겠다!!
df.drop_duplicates(['k1'])

    k1  k2
0  one   1
3  two   3

In [78]:
df.drop_duplicates(['k1', 'k2'])

    k1  k2
0  one   1
2  one   2
3  two   3
5  two   4

## Replacing Value

In [79]:
df

    k1  k2
0  one   1
1  one   1
2  one   2
3  two   3
4  two   3
5  two   4
6  two   4

In [80]:
# one 값을 찾아서 ONE으로 변경
df.replace('one','ONE')

    k1  k2
0  ONE   1
1  ONE   1
2  ONE   2
3  two   3
4  two   3
5  two   4
6  two   4

In [82]:
df.replace(3,300)

    k1   k2
0  one    1
1  one    1
2  one    2
3  two  300
4  two  300
5  two    4
6  two    4

In [86]:
df.replace(['one',3], ['ONE',300])  # 숫자는 '3' 이 아닌 3을 넣어야 찾아짐.

    k1   k2
0  ONE    1
1  ONE    1
2  ONE    2
3  two  300
4  two  300
5  two    4
6  two    4